mariogiampieri/gtfs-compass/firmware/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# 32MB flash, octal PSRAM (ESP32-S3R8) — 410x502 RGB565 needs PSRAM headroom
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Perf: the board screen wants smooth partial refresh
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# TLS to *.workers.dev via the default cert bundle
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y

# LVGL config comes from the repo's canonical lv_conf.h (component wiring)

# LVGL (managed component configures via Kconfig; mirror of lv_conf.h)
# Fonts: converted IBM Plex Sans faces compiled into components/ui (plan U6);
# built-in Montserrat sizes retired. LVGL's Kconfig defaults keep Montserrat 14
# as the theme default font — same as lv_conf.h on the sim side.
CONFIG_LV_COLOR_DEPTH_16=y

# Console over the native USB-JTAG port (same cable as flashing) — the
# provisioning REPL (wifi_set) lives here.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
